#include <stdio.h> //標準入出力ライブラリ（stdio.h）の読み込み

int main() // メイン処理の開始
{
	/*
	* Blue Archive 青輝石シミュレーター v1.1.1
	* 目的：所持している青輝石の数から、何をどれだけできるかを算出する
	*
	* 【用語解説】
	* Blue Archive（ブルーアーカイブ）：スマホゲームの一つ
	* 青輝石：ゲーム内通貨
	* クレジット：下級ゲーム内通貨
	* AP：スタミナ
	* 生徒募集：ガチャ
	* 各種チケット：プレイ数上限増加（1日6回まで無償）
	* Hard任務追加：プレイ数上限増加（1日3回まで無償）
	* 戦術対抗戦スキップ：プレイ数上限増加（1日に5回まで無償）
	* ショップの更新：アイテム購入上限増加
	*/

	int ishi; // 整数型：所持している青輝石（ishi）を作成

	// タイトル表示：コードの題名を表示
	printf("====================================================\n");	// 枠組みを表示
	printf("         Blue Archive - 青輝石シミュレーター        \n");	// コードの役割を表示
	printf("                 [  Powered by C  ]                 \n");	// C言語で書かれているということを表示
	printf("====================================================\n\n"); // 枠組みを表示

	printf("所持している青輝石の数を入力してください："); // 保持している青輝石数の入力を求める
	scanf("%d", &ishi); // 入力値を格納

	// 計算フェーズ：青輝石（ishi）の数をもとにできることを一気に計算
	int single = ishi / 120;	// 生徒募集（単発）の回数（式：青輝石÷120）
	int decuple = ishi / 1200;	// 生徒募集（10連）の回数（式：青輝石÷1200）
	int pity = ishi / 24000;	// 生徒募集の天井（200連）までの到達回数（式：青輝石÷24000）
	int ap = (ishi / 30) * 120; // 獲得可能な総AP量（式：(青輝石÷30)×120）
	int credit = ishi / 60;	// 購入可能なクレジット(m)（式：青輝石÷60）
	int ticket_res = ishi / 30; // 各種チケットの合計枚数（式：青輝石÷30）
	int hard_res = ishi / 40;	// Hard任務のリセット可能回数（式：青輝石÷40）
	int tact_res = ishi / 60;	// 戦術対抗戦のスキップ可能回数（式：青輝石÷60）
	int shop_res = ishi / 10;	// ショップ更新の実行可能回数（式：青輝石÷10）

	// 出力フェーズ：計算した型たちを組み込んだ文章を表示
	// 出力の各行の説明は省略　「-」と「│」を用いて見やすく工夫
	printf("\n【分析結果：現在の青輝石でできること】\n");
	printf("-----------------------------------------------------------------\n");
	printf("  項目名               | 消費石数 | 内容\n");
	printf("-----------------------------------------------------------------\n");

	printf("  生徒募集（単発）     | 120個    | %d 回募集可能\n", single);
	printf("  生徒募集（10連）     | 1,200個  | %d 回募集可能\n", decuple);
	printf("  生徒募集確定（天井） | 24,000個 | %d 回分\n", pity);
	printf("  AP回復               | 30個     | 合計 %d AP回復可能\n", ap);
	printf("  クレジット購入       | 60個     | 合計 %dM 購入可能\n", credit);
	printf("  各種チケット購入     | 30個     | 各種チケット合計 %d 枚分\n", ticket_res);
	printf("  ハード任務リセット   | 40個     | 挑戦回数 %d 回分回復可能\n", hard_res);
	printf("  戦術対抗戦チケット   | 60個     | 待機時間 %d 回分回復可能\n", tact_res);
	printf("  ショップ更新         | 10個     | ショップを %d 回更新可能\n", shop_res);

	printf("-----------------------------------------------------------------\n");
	printf("※ 上記の内容には1日あたりの上限があるものがあります。\n");
	printf("※ 青輝石の消費は計画的に。\n");

	return 0; // 正常終了（コード0）を返してプログラムを終了
}